---
kind: property
id: P:Autodesk.Revit.DB.PhaseArray.Size
source: html/2ab58ee3-57e2-5cf4-9cd2-d2a284f9e612.htm
---
# Autodesk.Revit.DB.PhaseArray.Size Property

Returns the number of phases that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```